{"config": [{"config": {"function": ["\u00e3\u0002\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\b\u0000\u0000\u0000C\u0000\u0000\u0000s\"\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000|\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000\u0083\u0001\u0003S)\u0006N\u00da\u0004size\u00da\u0006method\u00e9\u0003\u0000\u0000\u0000\u00da\ralign_cornersF)\u0003\u00da\u0002tf\u00da\u0005image\u00da\rresize_images)\u0002r\u0006\u0000\u0000\u0000Z\bnew_size\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-f83213692d3a>\u00da\fresize_image\u0006\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", [[66, 200]], null], "function_type": "lambda", "trainable": true, "output_shape": [66, 200, 3], "name": "lambda_1", "output_shape_type": "raw", "batch_input_shape": [null, 80, 320, 3], "input_dtype": "float32", "arguments": {}}, "class_name": "Lambda"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-f83213692d3a>\u00da\b<lambda>\u000f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "output_shape": null, "name": "lambda_2", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_5", "bias": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "name": "dense_1", "output_dim": 512, "bias": true, "W_regularizer": null, "activation": "relu", "input_dim": 1152}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "name": "dense_2", "output_dim": 128, "bias": true, "W_regularizer": null, "activation": "relu", "input_dim": 512}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "name": "dense_3", "output_dim": 1, "bias": true, "W_regularizer": null, "activation": "linear", "input_dim": 128}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}