{"keras_version": "1.2.2", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0002\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\b\u0000\u0000\u0000C\u0000\u0000\u0000s\"\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000|\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000\u0083\u0001\u0003S)\u0006N\u00da\u0004size\u00da\u0006method\u00e9\u0003\u0000\u0000\u0000\u00da\ralign_cornersF)\u0003\u00da\u0002tf\u00da\u0005image\u00da\rresize_images)\u0002r\u0006\u0000\u0000\u0000\u00da\bnew_size\u00a9\u0000r\t\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-00f11d9111fa>\u00da\fresize_image\u0006\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", [[66, 200]], null], "name": "lambda_1", "trainable": true, "output_shape": [66, 200, 3], "input_dtype": "float32", "batch_input_shape": [null, 80, 320, 3], "output_shape_type": "raw", "function_type": "lambda", "arguments": {}}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-00f11d9111fa>\u00da\b<lambda>\u000f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_2", "trainable": true, "output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 24, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 36, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 48, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "nb_col": 3, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "nb_col": 3, "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 128, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 1152, "bias": true, "activation": "relu", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 128, "bias": true, "activation": "linear", "W_constraint": null, "activity_regularizer": null}}], "class_name": "Sequential"}