{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0002\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\b\u0000\u0000\u0000C\u0000\u0000\u0000s\"\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000|\u0001\u0000d\u0002\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000\u0083\u0001\u0003S)\u0006N\u00da\u0004size\u00da\u0006method\u00e9\u0003\u0000\u0000\u0000\u00da\ralign_cornersF)\u0003\u00da\u0002tf\u00da\u0005image\u00da\rresize_images)\u0002r\u0006\u0000\u0000\u0000\u00da\bnew_size\u00a9\u0000r\t\u0000\u0000\u0000\u00fa#/Users/Hailin/Desktop/Test/model.py\u00da\fresize_image8\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", [[66, 200]], null], "name": "lambda_1", "output_shape_type": "raw", "batch_input_shape": [null, 80, 320, 3], "arguments": {}, "trainable": true, "output_shape": [66, 200, 3], "function_type": "lambda", "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa#/Users/Hailin/Desktop/Test/model.py\u00da\b<lambda>A\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_2", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_row": 5, "name": "convolution2d_1", "nb_filter": 24, "b_constraint": null, "nb_col": 5, "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "nb_filter": 36, "b_constraint": null, "nb_col": 5, "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "nb_filter": 48, "b_constraint": null, "nb_col": 5, "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_row": 3, "name": "convolution2d_5", "nb_filter": 64, "b_constraint": null, "nb_col": 3, "activation": "relu", "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "input_dim": 1152, "activation": "relu", "b_constraint": null, "trainable": true, "output_dim": 128}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "input_dim": 128, "activation": "linear", "b_constraint": null, "trainable": true, "output_dim": 1}}], "keras_version": "1.2.2"}